[
{
    "name": "SigSpace: Trying to Find Chinatown",
    "date": "Mon, May 23, 2022",
    "time": "7:30 pm - 8:30 pm",
    "location": "Signature Theater Virtual Event",
    "owner": "Esther Kim Lee, Jeff Liu & David Henry Hwang",
    "description": "Tune in for the world premiere virtual screening of David Henry Hwang's short film Trying to Find Chinatown directed by Jeff Liu, an adaptation of Hwang's play of the same title. Followed by a discussion with writer and director, moderated by Dr. Esther Kim Lee (Professor of Theater Studies at Duke University.About the Film Adapted from the play Trying to Find Chinatown, this short film directed by Jeff Liu is an exploration of racial identity and appearance, revolves around the interaction between an Asian street musician and a Caucasian man who claims Asian American heritage.\"David Henry Hwang is a true original. A native of Los Angeles, born to immigrant parents, he has one foot on each side of a cultural divide. By at once bringing West and East into conflict and unity, this playwright has found the perfect means to dramatize both the pain and humor of the immigrant experience.\" -Frank Rich, New York Times"
},

{
    "name": "Ciompi Presents: Quartets of Brahms and Lindroth",
    "date": "Tuesday, June 07, 2022",
    "time": "7:00 pm",
    "location": "Sarah P. Duke Gardens",
    "owner": "Esther Kim Lee, Jeff Liu & David Henry Hwang",
    "description": "The second concert of the Ciompi Presents 2022 Summer Chamber Music Series features Jonathan Bagg, violist, performing with Laura Gilbert (flute), Nicholas DiEugenio (violin), Raman Ramakrishnan (cello) and Mimi Solomon (piano). Program: Brahms' Piano Quartet Op. 60, a new flute quartet by Duke faculty composer Scott Lindroth, works by David Kirkland Garner and Tatiana Nikolaeva. This concert takes place at Kirby Horton Hall, Doris Duke Center, Sarah P. Duke Gardens, 420 Anderson St, Durham, NC.Tickets on sale on May 24 at tickets.duke.edu. Series subscription (4 concerts): $60 Single tickets: General public: $25, Non-Duke students & Duke employees: $20, Youth & Duke students: $10. Jonathan Bagg is Professor of the Practice at Duke University and violist of the Ciompi String Quartet. His career with the Ciompi includes hundreds of concerts at chamber music venues across the U.S. and around the world, as well as many recordings. Currently co-Artistic Director of Electric Earth Concerts in New Hampshire, Bagg teaches viola and chamber music at Duke and is Chair of the Music Department. Laura Gilbert has appeared around the world as chamber musician, soloist, recitalist and guest lecturer. In 2012 she co-founded Electric Earth Concerts. In addition to founding and performing with Auréole, a flute, viola and harp trio, she has appeared with Musicians from Marlboro, Alexander Schneider's Brandenburg Ensemble, the Borromeo, Brentano, Saint Lawrence, and Ciompi String Quartets, among others. She is on the faculties of Mannes College of Music and Saint Ann's School. Praised by the New York Times for his \"excellent\" and \"evocative\" playing, Nicholas DiEugenio has twice been a prize winner at the Fischoff Competition. He is director of the Luby Violin Symposium at UNC Chapel Hill, where he is Assistant Professor of Violin. As a member of the Horszowski Trio, Raman Ramakrishnan has performed across North America, Europe, India, Japan, and in Hong Kong, and recorded for Bridge Records and Avie Records. He is an artist member of the Boston Chamber Music Society and teaches at Bard Conservatory. Mimi Solomon has performed throughout the United States, China, Japan and Europe, and has appeared as soloist with orchestras including Shanghai Symphony, Philharmonia Virtuosi, and Yale Symphony Orchestra. She is currently on the faculty of the University of North Carolina at Chapel Hill."
}
]
